SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/EFM32PG26/Include/efm32pg26_msc.h
/* Bit fields for MSC PAGELOCKWORD11 */
#define _MSC_PAGELOCKWORD11_RESETVALUE            0x00000000UL                               /**< Default value for MSC_PAGELOCKWORD11        */
#define _MSC_PAGELOCKWORD11_MASK                  0xFFFFFFFFUL                               /**< Mask for MSC_PAGELOCKWORD11                 */
#define _MSC_PAGELOCKWORD11_LOCKBIT_SHIFT         0                                          /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD11_LOCKBIT_MASK          0xFFFFFFFFUL                               /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD11_LOCKBIT_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for MSC_PAGELOCKWORD11         */
#define MSC_PAGELOCKWORD11_LOCKBIT_DEFAULT        (_MSC_PAGELOCKWORD11_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD11 */

/* Bit fields for MSC PAGELOCKWORD12 */
#define _MSC_PAGELOCKWORD12_RESETVALUE            0x00000000UL                               /**< Default value for MSC_PAGELOCKWORD12        */
#define _MSC_PAGELOCKWORD12_MASK                  0x0000FFFFUL                               /**< Mask for MSC_PAGELOCKWORD12                 */
#define _MSC_PAGELOCKWORD12_LOCKBIT_SHIFT         0                                          /**< Shift value for MSC_LOCKBIT                 */
#define _MSC_PAGELOCKWORD12_LOCKBIT_MASK          0xFFFFUL                                   /**< Bit mask for MSC_LOCKBIT                    */
#define _MSC_PAGELOCKWORD12_LOCKBIT_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for MSC_PAGELOCKWORD12         */
#define MSC_PAGELOCKWORD12_LOCKBIT_DEFAULT        (_MSC_PAGELOCKWORD12_LOCKBIT_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_PAGELOCKWORD12 */

/** @} End of group EFM32PG26_MSC_BitFields */
/** @} End of group EFM32PG26_MSC */
/** @} End of group Parts */

#endif // EFM32PG26_MSC_H
